Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM5164LS60064.PIC
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="-----------------------------n-n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x5" edc:_addr="0x40001408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:nzwidth="0x1" edc:desc="XOSC32K Clock Failure Detector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="---------------------------rrr-r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1D" edc:_addr="0x4000140C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:nzwidth="0x1" edc:desc="XOSC32K Clock Failure Detector"/>
            <edc:SFRFieldDef edc:cname="CLKSW" edc:nzwidth="0x1" edc:desc="XOSC32K Clock switch"/>
            <edc:SFRFieldDef edc:cname="ULP32KSW" edc:nzwidth="0x1" edc:desc="OSCULP32K Clock Switch"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="RTCCTRL" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x40001410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="RTCSEL" edc:nzwidth="0x3" edc:desc="RTC Clock Selection">
              <edc:SFRFieldSemantic edc:cname="ULP1K" edc:desc="1.024kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ULP32K" edc:desc="32.768kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="XOSC1K" edc:desc="1.024kHz from 32.768kHz external crystal oscillator" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="32.768kHz from 32.768kHz external crystal oscillator" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001411"/>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="XOSC32K" edc:nzwidth="0x10" edc:access="---n-nnnnn-nnnn-" edc:por="0000000010000000" edc:mclr="0000000010000000" edc:impl="0x17DE" edc:_addr="0x40001414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:nzwidth="0x1" edc:desc="Crystal Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:nzwidth="0x1" edc:desc="32kHz Output Enable"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:nzwidth="0x1" edc:desc="1kHz Output Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x3" edc:desc="Oscillator Start-Up Time">
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62.5 ms" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125 ms" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500 ms" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000 ms" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE65536" edc:desc="2000 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE131072" edc:desc="4000 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE262144" edc:desc="8000 ms" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="CFDCTRL" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x40001416">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:SFRFieldDef edc:cname="SWBACK" edc:nzwidth="0x1" edc:desc="Clock Switch Back Enable"/>
            <edc:SFRFieldDef edc:cname="CFDPRESC" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40001417">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40001418"/>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="OSCULP32K" edc:nzwidth="0x20" edc:access="----------------n---------n-----" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8020" edc:_addr="0x4000141C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ULP32KSW" edc:nzwidth="0x1" edc:desc="OSCULP32K Clock Switch Enable"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3E0" edc:_addr="0x40001420"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="-------------n------nn-n-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x40D07" edc:_addr="0x40001800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
            <edc:SFRFieldDef edc:cname="ULPVREFRDY" edc:nzwidth="0x1" edc:desc="ULPVREF Voltage Reference Ready"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="VCOREPLLRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator PLL Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="-------------n------nn-n-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x40D07" edc:_addr="0x40001804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
            <edc:SFRFieldDef edc:cname="ULPVREFRDY" edc:nzwidth="0x1" edc:desc="ULPVREF Voltage Reference Ready"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="VCOREPLLRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator PLL Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="-------------n------nn-n-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x40D07" edc:_addr="0x40001808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
            <edc:SFRFieldDef edc:cname="ULPVREFRDY" edc:nzwidth="0x1" edc:desc="ULPVREF Voltage Reference Ready"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="VCOREPLLRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator PLL Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="-------------r-----r-r-r-----rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x41507" edc:_addr="0x4000180C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:nzwidth="0x1" edc:desc="BOD33 Ready"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:nzwidth="0x1" edc:desc="BOD33 Detection"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:nzwidth="0x1" edc:desc="BOD33 Synchronization Ready"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:nzwidth="0x1" edc:desc="VDDCORE Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ULPVREFRDY" edc:nzwidth="0x1" edc:desc="Low Power Voltage Reference Ready"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VCOREPLLRDY" edc:nzwidth="0x1" edc:desc="Voltage Regulator PLL Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="BOD33" edc:nzwidth="0x20" edc:access="----------nnnnnnnnnnn--n-nnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF97E" edc:_addr="0x40001810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action when Threshold Crossed">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BOD33 generates a reset" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BOD33 generates an interrupt" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STDBYCFG" edc:nzwidth="0x1" edc:desc="Configuration in Standby mode"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTCFG" edc:nzwidth="0x1" edc:desc="Configuration in Active mode"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:nzwidth="0x1" edc:desc="BOD33 Voltage Reference Selection">
              <edc:SFRFieldSemantic edc:cname="SEL_VREF" edc:desc="Selects VREF for the BOD33" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SEL_ULPVREF" edc:desc="Selects ULPVREF for the BOD33" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSEL" edc:nzwidth="0x4" edc:desc="Prescaler Select">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:nzwidth="0x6" edc:desc="Threshold Level for VDD/AVDD"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
