Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM5164LS60064.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40002A24"/>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="DEBOUNCEN" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002A30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="DEBOUNCEN0" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT0"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN1" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN2" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT2"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN3" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT3"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN4" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT4"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN5" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT5"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN6" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT6"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN7" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT7"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN8" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT8"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN9" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT9"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN10" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT10"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN11" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT11"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN12" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT12"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN13" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT13"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN14" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT14"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN15" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="DPRESCALER" edc:nzwidth="0x20" edc:access="---------------n--------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x100FF" edc:_addr="0x40002A34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="PRESCALER0" edc:nzwidth="0x3" edc:desc="Debouncer Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES0" edc:nzwidth="0x1" edc:desc="Debouncer number of states">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCALER1" edc:nzwidth="0x3" edc:desc="Debouncer Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES1" edc:nzwidth="0x1" edc:desc="Debouncer number of states">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TICKON" edc:nzwidth="0x1" edc:desc="Pin Sampler frequency selection">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK_EIC" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_LFREQ" edc:desc="Clocked by Low Frequency Clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
