Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM5164LS60064.PIC
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x4100500B"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x4100500C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="NVM Done Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error Status Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error Status Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:nzwidth="0x1" edc:desc="Key Write Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="NS configuration change detected Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4100500D"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x41005010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="NVM Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:nzwidth="0x1" edc:desc="Key Write Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="NS configuration change detected Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x41005011"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x41005014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="NVM Done"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error Status"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error Status"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:nzwidth="0x1" edc:desc="KEY Write Error"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="NS configuration change detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x41005015"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="STATUS" edc:nzwidth="0x10" edc:access="-----------rrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x1F" edc:_addr="0x41005018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="PRM" edc:nzwidth="0x1" edc:desc="Power Reduction Mode"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:nzwidth="0x1" edc:desc="NVM Page Buffer Active Loading"/>
            <edc:SFRFieldDef edc:cname="READY" edc:nzwidth="0x1" edc:desc="NVM Ready"/>
            <edc:SFRFieldDef edc:cname="DALFUSE" edc:nzwidth="0x2" edc:desc="Debug Access Level Fuse">
              <edc:SFRFieldSemantic edc:cname="DAL0" edc:desc="Access to very limited features" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DAL1" edc:desc="Access to all non-secure memory. Can debug non-secure CPU code" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAL2" edc:desc="Access to all memory. Can debug secure and non-secure CPU code" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4100501A"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="--------nn------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC0FFFF" edc:_addr="0x4100501C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="AOFFSET" edc:nzwidth="0x10" edc:desc="NVM Address Offset In The Selected Array"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ARRAY" edc:nzwidth="0x2" edc:desc="Array Select">
              <edc:SFRFieldSemantic edc:cname="FLASH" edc:desc="FLASH" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATAFLASH" edc:desc="DATA FLASH" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NVMROWS" edc:desc="NVM Configuration Rows" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="SULCK" edc:nzwidth="0x10" edc:access="nnnnnnnn-----nnn" edc:impl="0xFF07" edc:_addr="0x41005020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="BS" edc:nzwidth="0x1" edc:desc="Secure Boot Region"/>
            <edc:SFRFieldDef edc:cname="AS" edc:nzwidth="0x1" edc:desc="Secure Application Region"/>
            <edc:SFRFieldDef edc:cname="DS" edc:nzwidth="0x1" edc:desc="Data Secure Region"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SLKEY" edc:nzwidth="0x8" edc:desc="Write Key">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Write Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="NSULCK" edc:nzwidth="0x10" edc:access="nnnnnnnn-----nn-" edc:impl="0xFF06" edc:_addr="0x41005022">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS" edc:nzwidth="0x1" edc:desc="Non-Secure Application Region"/>
            <edc:SFRFieldDef edc:cname="DNS" edc:nzwidth="0x1" edc:desc="Non-Secure Data Region"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="NSLKEY" edc:nzwidth="0x8" edc:desc="Write Key">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Write Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="PARAM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnn-nnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF7FFFF" edc:_addr="0x41005024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="FLASHP" edc:nzwidth="0x10" edc:desc="FLASH Pages"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:nzwidth="0x3" edc:desc="Page Size">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLASHP" edc:nzwidth="0xC" edc:desc="DATAFLASH Pages"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41005028"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="DSCC" edc:nzwidth="0x20" edc:access="--wwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x41005030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DSCKEY" edc:nzwidth="0x1E" edc:desc="Data Scramble Key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
