Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM5164LS60064.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200303A"/>
      <edc:SFRDef ltx:memberofperipheral="TCC2" edc:cname="WAVE" edc:nzwidth="0x20" edc:access="----nnnn----nnnn----nnnnnnnn-nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0F0FF7" edc:_addr="0x4200303C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:nzwidth="0x3" edc:desc="Waveform Generation">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DPWM" edc:desc="Dual compare PWM" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DSCRITICAL" edc:desc="Dual-slope critical" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTTOM" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTH" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DSTOP" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches TOP" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMP" edc:nzwidth="0x3" edc:desc="Ramp Mode">
              <edc:SFRFieldSemantic edc:cname="RAMP1" edc:desc="RAMP1 operation" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2A" edc:desc="Alternative RAMP2 operation" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2" edc:desc="RAMP2 operation" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2C" edc:desc="Critical RAMP2 operation" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2CS" edc:desc="Critical Swapped RAMP2 operation" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CIPEREN" edc:nzwidth="0x1" edc:desc="Circular period Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN0" edc:nzwidth="0x1" edc:desc="Circular Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN1" edc:nzwidth="0x1" edc:desc="Circular Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN2" edc:nzwidth="0x1" edc:desc="Circular Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN3" edc:nzwidth="0x1" edc:desc="Circular Channel 3 Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="POL0" edc:nzwidth="0x1" edc:desc="Channel 0 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POL1" edc:nzwidth="0x1" edc:desc="Channel 1 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POL2" edc:nzwidth="0x1" edc:desc="Channel 2 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POL3" edc:nzwidth="0x1" edc:desc="Channel 3 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SWAP0" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 0"/>
            <edc:SFRFieldDef edc:cname="SWAP1" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 1"/>
            <edc:SFRFieldDef edc:cname="SWAP2" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 2"/>
            <edc:SFRFieldDef edc:cname="SWAP3" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC2" edc:cname="PER" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:impl="0xFFFFFF" edc:_addr="0x42003040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x18" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x14" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x13" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x12" edc:desc="Period Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
