Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM5164LS60064.PIC
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="n-nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xBF" edc:addr="0x42001816">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DRE" edc:nzwidth="0x1" edc:desc="Data Register Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:nzwidth="0x1" edc:desc="Transmit Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:nzwidth="0x1" edc:desc="Receive Start Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear To Send Input Change Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Break Received Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Combined Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="n-nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xBF" edc:addr="0x42001818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DRE" edc:nzwidth="0x1" edc:desc="Data Register Empty Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:nzwidth="0x1" edc:desc="Transmit Complete Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:nzwidth="0x1" edc:desc="Receive Start Interrupt"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear To Send Input Change Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Break Received Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Combined Error Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="STATUS" edc:nzwidth="0x10" edc:access="--------nnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF" edc:addr="0x4200181A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Parity Error"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Frame Error"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:nzwidth="0x1" edc:desc="Buffer Overflow"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:nzwidth="0x1" edc:desc="Clear To Send"/>
            <edc:SFRFieldDef edc:cname="ISF" edc:nzwidth="0x1" edc:desc="Inconsistent Sync Field"/>
            <edc:SFRFieldDef edc:cname="COLL" edc:nzwidth="0x1" edc:desc="Collision Detected"/>
            <edc:SFRFieldDef edc:cname="TXE" edc:nzwidth="0x1" edc:desc="Transmitter Empty"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:nzwidth="0x1" edc:desc="Maximum Number of Repetitions Reached"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="---------------------------rrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:addr="0x4200181C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="SERCOM Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="CTRLB Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="RXERRCNT" edc:nzwidth="0x1" edc:desc="RXERRCNT Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:nzwidth="0x1" edc:desc="LENGTH Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="RXERRCNT" edc:nzwidth="0x8" edc:access="rrrrrrrr" edc:por="00000000" edc:mclr="00000000" edc:addr="0x42001820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="RXERRCNT" edc:nzwidth="0x8" edc:desc="Receive Error Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="LENGTH" edc:nzwidth="0x10" edc:access="------nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FF" edc:addr="0x42001822">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x8" edc:desc="Data Length"/>
            <edc:SFRFieldDef edc:cname="LENEN" edc:nzwidth="0x2" edc:desc="Data Length Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Length counter is disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TX" edc:desc="Length counter is enabled for transmit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RX" edc:desc="Length counter is enabled for receive" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x42001828">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:addr="0x42001830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:nzwidth="0x1" edc:desc="Debug Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="FIFOSPACE" edc:nzwidth="0x10" edc:access="---rrrrr---rrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x1F1F" edc:addr="0x42001834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="TXSPACE" edc:nzwidth="0x5" edc:desc="Tx FIFO Empty Space"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RXSPACE" edc:nzwidth="0x5" edc:desc="Rx FIFO Filled Space"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="FIFOPTR" edc:nzwidth="0x10" edc:access="----nnnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF0F" edc:addr="0x42001836">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="CPUWRPTR" edc:nzwidth="0x4" edc:desc="CPU FIFO Write Pointer"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CPURDPTR" edc:nzwidth="0x4" edc:desc="CPU FIFO Read Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TC0/COUNT8">
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="COUNT" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0x42001C14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x8" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
